---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWall
source: html/5963a52f-5ba2-d67e-3878-3e5509e74f5e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWall Property

Cannot create wall - it would intersect itself. Reduce the wall's height or slant.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawSingularSlantedWall { get; }
```